# Get2DComponentGroup

## Description
Gets the specified 2D component group of a symbol definition or plug-in object or NULL if the group does not exist.

**Table - 2D components**

| Constant | 2D component        |
|----------|--------------------|
| 0        | Not Set            |
| 1        | Top                |
| 2        | Bottom             |
| 3        | Top and Bottom Cut |
| 4        | Front              |
| 5        | Back               |
| 6        | Front and Back Cut |
| 7        | Left               |
| 8        | Right              |
| 9        | Left and Right Cut |

```pascal
FUNCTION Get2DComponentGroup(
				objectHandle : HANDLE;
				component    : INTEGER): HANDLE;
```

```python
def vs.Get2DComponentGroup(objectHandle, component):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|Handle to the object.|
|component|INTEGER|2D component.|

## Examples
```pascal
resultH := Get2DComponentGroup(objectHandle, 1);
```
```python
import vs

# Gets the specified 2D component group of a symbol definition or plug-in
# object or NULL if the group does not exist.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer
component = 1

objHandle = vs.Get2DComponentGroup(objectHandle, component)
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## See Also
VS Functions:
Set2DComponentGroup
| SetTopPlan2DComp
| GetTopPlan2DComp

## Version
Availability: from Vectorworks 2019

## Category
* Objects - Custom